IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/LIN1_LIN1.xml
	<register id="LIN1_SCISETINT" acronym="LIN1_SCISETINT" offset="0xC" width="32" description="The SCISETINT register is used to enable the various interrupts available in the LIN module.">
		<bitfield id="SETBEINT" width="1" begin="31" end="31" resetval="0x0" description="Set bit error interrupt.This bit is effective in LIN mode only. Setting this bit enables the SCI/LIN module to generate an interrupt when there is a bit error. This field is writable in LIN mode only." range="31" rwaccess="R/W1TS"/> 
		<bitfield id="SETPBEINT" width="1" begin="30" end="30" resetval="0x0" description="Set physical bus error interrupt.This bit is effective in LIN mode only. Setting this bit enables the SCI/LIN module to generate an interrupt when a physical bus error occurs. This field is writable in LIN mode only." range="30" rwaccess="R/W1TS"/> 
		<bitfield id="SETCEINT" width="1" begin="29" end="29" resetval="0x0" description="Set checksum-error Interrupt.This bit is effective in LIN mode only. Setting this bit enables the SCI/LIN module to generate an interrupt when there is a checksum error. This field is writable in LIN mode only." range="29" rwaccess="R/W1TS"/> 
		<bitfield id="SETISFEINT" width="1" begin="28" end="28" resetval="0x0" description="Set inconsistent-sync-field-error interrupt.This bit is effective in LIN mode only. Setting this bit enables the SCI/LIN module to generate an interrupt when there is an inconsistent sync field error. This field is writable in LIN mode only." range="28" rwaccess="R/W1TS"/> 
		<bitfield id="SETNREINT" width="1" begin="27" end="27" resetval="0x0" description="Set no-response-error interrupt.This bit is effective in LIN mode only. Setting this bit enables the SCI/LIN module to generate an interrupt when a no-response error occurs. This field is writable in LIN mode only." range="27" rwaccess="R/W1TS"/> 
		<bitfield id="SETFEINT" width="1" begin="26" end="26" resetval="0x0" description="Set framing-error interrupt.This bit is effective in LIN or SCI-compatible mode. Setting this bit enables the SCI/LIN module to generate an interrupt when a framing error occurs." range="26" rwaccess="R/W1TS"/> 
		<bitfield id="SETOEINT" width="1" begin="25" end="25" resetval="0x0" description="Set overrun-error interrupt.This bit is effective in LIN or SCI-compatible mode. Setting this bit enables the SCI/LIN module to generate an interrupt when an overrun error occurs." range="25" rwaccess="R/W1TS"/> 
		<bitfield id="SETPEINT" width="1" begin="24" end="24" resetval="0x0" description="Set parity interrupt.This bit is effective in LIN or SCI-compatible mode. Setting this bit enables the SCI/LIN module to generate an interrupt when a parity error occurs." range="24" rwaccess="R/W1TS"/> 
		<bitfield id="SET_RX_DMA_ALL" width="1" begin="18" end="18" resetval="0x0" description="Set receiver DMA for Address &#38; Data frames.This bit is effective in LIN or SCI-compatible mode. To enable RX DMA request for address and data frames this bit must be set. If it is cleared, RX interrupt request is generated for address frames and DMA requests are generated for data frames. " range="18" rwaccess="R/W1TS"/> 
		<bitfield id="SET_RX_DMA" width="1" begin="17" end="17" resetval="0x0" description="Set receiver DMA.This bit is effective in LIN or SCI-compatible mode. To enable DMA requests for the receiver this bit must be set. If it is cleared, interrupt requests are generated depending on SETRXINT." range="17" rwaccess="R/W1TS"/> 
		<bitfield id="SET_TX_DMA" width="1" begin="16" end="16" resetval="0x0" description="Set transmit DMA.This bit is effective in LIN or SCI-compatible mode. To enable DMA requests for the transmitter, this bit must be set. If it is cleared, interrupt requests are generated depending on SETTXINT." range="16" rwaccess="R/W1TS"/> 
		<bitfield id="SETIDINT" width="1" begin="13" end="13" resetval="0x0" description="Set Identification interrupt.This bit is effective in LIN mode only. This bit is set to enable interrupt once a valid matching identifier is received." range="13" rwaccess="R/W1TS"/> 
		<bitfield id="SETRXINT" width="1" begin="9" end="9" resetval="0x0" description="Set Receiver interrupt.Setting this bit enables the SCI/LIN to generate a receive interrupt after a frame has been completely received and the data is being transferred from SCIRXSHF to SCIRD." range="9" rwaccess="R/W1TS"/> 
		<bitfield id="SETTXINT" width="1" begin="8" end="8" resetval="0x0" description="Set Transmitter interrupt.Setting this bit enables the SCI/LIN to generate a transmit interrupt as data is being transferred from SCITD to SCITXSHF and the TXRDY bit is being set." range="8" rwaccess="R/W1TS"/> 
		<bitfield id="SETTOA3WUSINT" width="1" begin="7" end="7" resetval="0x0" description="Set Timeout After 3 Wakeup Signals interrupt.This bit is effective in LIN mode only. Setting this bit enables the SCI/LIN to generate an interrupt when there is a timeout after 3 wakeup signals have been sent. This field is writable in LIN mode only." range="7" rwaccess="R/W1TS"/> 
		<bitfield id="SETTOAWUSINT" width="1" begin="6" end="6" resetval="0x0" description="Set Timeout After Wakeup Signal interrupt.This bit is effective in LIN mode only. Setting this bit enables the SCI/LIN to generate an interrupt when there is a timeout after one wakeup signal has been sent. This field is writable in LIN mode only." range="6" rwaccess="R/W1TS"/> 
		<bitfield id="SETTIMEOUTINT" width="1" begin="4" end="4" resetval="0x0" description="Set timeout interrupt.This bit is effective in LIN mode only. Setting this bit enables the SCI/LIN to generate an interrupt when no LIN bus activity [bus idle] occurs for at least 4 seconds. This field is writable in LIN mode only." range="4" rwaccess="R/W1TS"/> 
		<bitfield id="SETWAKEUPINT" width="1" begin="1" end="1" resetval="0x0" description="Set wake-up interrupt.This bit is effective in LIN or SCI-compatible mode. Setting this bit enables the SCI/LIN to generate a wake-up interrupt and thereby exit low-power mode. The wake-up interrupt is asserted on falling edge of the wake-up pulse. If enabled, the wake-up interrupt is asserted when local low-power mode is requested while the receiver is busy or if a low level is detected on the SCIRX pin during low-power mode. Wake-up interrupt is not asserted upon a wakeup pulse if the module is not in power down mode." range="1" rwaccess="R/W1TS"/> 
		<bitfield id="SETBRKDTINT" width="1" begin="0" end="0" resetval="0x0" description="Set break-detect interrupt.This bit is effective in SCI-compatible mode only. Setting this bit enables the SCI/LIN to generate an interrupt if a break condition is detected on the LINRX pin. This field is writable in SCI mode only." range="0" rwaccess="R/W1TS"/>
	</register>
	<register id="LIN1_SCICLEARINT" acronym="LIN1_SCICLEARINT" offset="0x10" width="32" description="The SCICLEARINT register is used to disable the enabled interrupts without accessing the SCISETINT register.">
		<bitfield id="CLRBEINT" width="1" begin="31" end="31" resetval="0x0" description="Clear Bit Error Interrupt.This bit is effective in LIN mode only. Setting this bit disables the bit error interrupt. This field is writable in LIN mode only." range="31" rwaccess="R/W1TC"/> 
		<bitfield id="CLRPBEINT" width="1" begin="30" end="30" resetval="0x0" description="Clear Physical Bus Error Interrupt.This bit is effective in LIN mode only. Setting this bit disables the physical-bus error interrupt. This field is writable in LIN mode only." range="30" rwaccess="R/W1TC"/> 
		<bitfield id="CLRCEINT" width="1" begin="29" end="29" resetval="0x0" description="Clear checksum-error Interrupt.This bit is effective in LIN mode only. Setting this bit disables the checksum-error interrupt. This field is writable in LIN mode only." range="29" rwaccess="R/W1TC"/> 
		<bitfield id="CLRISFEINT" width="1" begin="28" end="28" resetval="0x0" description="Clear Inconsistent-Sync-Field-Error Interrupt.This bit is effective in LIN mode only. Setting this bit disables the ISFE interrupt. This field is writable in LIN mode only." range="28" rwaccess="R/W1TC"/> 
		<bitfield id="CLRNREINT" width="1" begin="27" end="27" resetval="0x0" description="Clear No-Reponse-Error Interrupt.This bit is effective in LIN mode only. Setting this bit disables the no-response error interrupt. This field is writable in LIN mode only." range="27" rwaccess="R/W1TC"/> 
		<bitfield id="CLRFEINT" width="1" begin="26" end="26" resetval="0x0" description="Clear Framing-Error Interrupt.This bit is effective in LIN or SCI-compatible mode. Setting this bit disables framing-error interrupt." range="26" rwaccess="R/W1TC"/> 
		<bitfield id="CLROEINT" width="1" begin="25" end="25" resetval="0x0" description="Clear Overrun-Error Interrupt.This bit is effective in LIN or SCI-compatible mode. Setting this bit disables the overrun interrupt." range="25" rwaccess="R/W1TC"/> 
		<bitfield id="CLRPEINT" width="1" begin="24" end="24" resetval="0x0" description="Clear Parity Interrupt.This bit is effective in LIN or SCI-compatible mode. Setting this bit disables the parity error interrupt." range="24" rwaccess="R/W1TC"/> 
		<bitfield id="SETRXDMA" width="1" begin="17" end="17" resetval="0x0" description="Clear receiver DMA.This bit is effective in LIN or SCI-compatible mode. Setting this bit disables the receive DMA request." range="17" rwaccess="R/W1TC"/> 
		<bitfield id="CLRTXDMA" width="1" begin="16" end="16" resetval="0x0" description="Clear transmit DMA.This bit is effective in LIN or SCI-compatible mode. Setting this bit disables the transmit DMA request." range="16" rwaccess="R/W1TC"/> 
		<bitfield id="CLRIDINT" width="1" begin="13" end="13" resetval="0x0" description="Clear Identifier interrupt.This bit is effective in LIN mode only. Setting this bit disables the ID interrupt." range="13" rwaccess="R/W1TC"/> 
		<bitfield id="CLRRXINT" width="1" begin="9" end="9" resetval="0x0" description="Clear Receiver interrupt.This bit is effective in LIN or SCI-compatible mode. Setting this bit disables the receiver interrupt." range="9" rwaccess="R/W1TC"/> 
		<bitfield id="CLRTXINT" width="1" begin="8" end="8" resetval="0x0" description="Clear Transmitter interrupt.This bit is effective in LIN or SCI-compatible mode. Setting this bit disables the transmitter interrupt." range="8" rwaccess="R/W1TC"/> 
		<bitfield id="CLRTOA3WUSINT" width="1" begin="7" end="7" resetval="0x0" description="Clear Timeout After 3 Wakeup Signals interrupt.This bit is effective in LIN mode only. Setting this bit disables the timeout after 3 wakeup signals interrupt. This field is writable in LIN mode only." range="7" rwaccess="R/W1TC"/> 
		<bitfield id="CLRTOAWUSINT" width="1" begin="6" end="6" resetval="0x0" description="Clear Timeout After Wakeup Signal interrupt.This bit is effective in LIN mode only. Setting this bit disables the timeout after one wakeup signal interrupt. This field is writable in LIN mode only." range="6" rwaccess="R/W1TC"/> 
		<bitfield id="CLRTIMEOUTINT" width="1" begin="4" end="4" resetval="0x0" description="Clear Timeout interrupt.This bit is effective in LIN mode only. Setting this bit disables the timeout [LIN bus idle] interrupt. This field is writable in LIN mode only." range="4" rwaccess="R/W1TC"/> 
		<bitfield id="CLRWAKEUPINT" width="1" begin="1" end="1" resetval="0x0" description="Clear Wake-up interrupt.This bit is effective in LIN or SCI-compatible mode. Setting this bit disables the wake-up interrupt." range="1" rwaccess="R/W1TC"/> 
		<bitfield id="CLRBRKDTINT" width="1" begin="0" end="0" resetval="0x0" description="Clear Break-detect interrupt.This bit is effective in SCI-compatible mode only. Setting this bit disables the Break-detect interrupt. This field is writable in SCI mode only." range="0" rwaccess="R/W1TC"/>
	</register>
	<register id="LIN1_SCISETINTLVL" acronym="LIN1_SCISETINTLVL" offset="0x14" width="32" description="The SCISETINTLVL register is used to map individual interrupt sources to the INT1 interrupt line.">
		<bitfield id="SETBEINTLVL" width="1" begin="31" end="31" resetval="0x0" description="Set Bit Error interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the Bit Error interrupt level to the INT1 line. This field is writable in LIN mode only." range="31" rwaccess="R/W1TS"/> 
		<bitfield id="SETPBEINTLVL" width="1" begin="30" end="30" resetval="0x0" description="Set Physical Bus Error interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the Physical Bus Error interrupt level to the INT1 line. This field is writable in LIN mode only." range="30" rwaccess="R/W1TS"/> 
		<bitfield id="SETCEINTLVL" width="1" begin="29" end="29" resetval="0x0" description="Set Checksum-error interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the Checksum-error interrupt level to the INT1 line. This field is writable in LIN mode only." range="29" rwaccess="R/W1TS"/> 
		<bitfield id="SETISFEINTLVL" width="1" begin="28" end="28" resetval="0x0" description="Set Inconsistent-Sync-Field-Error interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the Inconsistent-Sync-Field-Error interrupt level to the INT1 line. This field is writable in LIN mode only." range="28" rwaccess="R/W1TS"/> 
		<bitfield id="SETNREINTLVL" width="1" begin="27" end="27" resetval="0x0" description="Set No-Reponse-Error interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the No-Response-Error interrupt level to the INT1 line. This field is writable in LIN mode only." range="27" rwaccess="R/W1TS"/> 
		<bitfield id="SETFEINTLVL" width="1" begin="26" end="26" resetval="0x0" description="Set Framing-Error interrupt level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the Framing-Error interrupt level to the INT1 line." range="26" rwaccess="R/W1TS"/> 
		<bitfield id="SETOEINTLVL" width="1" begin="25" end="25" resetval="0x0" description="Set Overrun-Error Interrupt Level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the Overrun-Error interrupt level to the INT1 line." range="25" rwaccess="R/W1TS"/> 
		<bitfield id="SETPEINTLVL" width="1" begin="24" end="24" resetval="0x0" description="Set Parity Error interrupt level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the Parity error interrupt level to the INT1 line." range="24" rwaccess="R/W1TS"/> 
		<bitfield id="SETIDINTLVL" width="1" begin="13" end="13" resetval="0x0" description="Set ID interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the ID interrupt level to the INT1 line. This field is writable in LIN mode only." range="13" rwaccess="R/W1TS"/> 
		<bitfield id="SETRXINTOVO" width="1" begin="9" end="9" resetval="0x0" description="Set Receiver interrupt level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the receiver interrupt level to the INT1 line." range="9" rwaccess="R/W1TS"/> 
		<bitfield id="SETTXINTLVL" width="1" begin="8" end="8" resetval="0x0" description="Set Transmitter interrupt level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the transmitter interrupt level to the INT1 line." range="8" rwaccess="R/W1TS"/> 
		<bitfield id="SETTOA3WUSINTLVL" width="1" begin="7" end="7" resetval="0x0" description="Set Timeout After 3 Wakeup Signals interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the timeout after 3 wakeup signals interrupt level to the INT1 line. This field is writable in LIN mode only." range="7" rwaccess="R/W1TS"/> 
		<bitfield id="SETTOAWUSINTLVL" width="1" begin="6" end="6" resetval="0x0" description="Set Timeout After Wakeup Signal interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the the timeout after wakeup interrupt level to the INT1 line. This field is writable in LIN mode only." range="6" rwaccess="R/W1TS"/> 
		<bitfield id="SETTIMEOUTINTLVL" width="1" begin="4" end="4" resetval="0x0" description="Set Timeout interrupt level.This bit is effective in LIN mode only. Writing to this bit maps the timeout interrupt level to the INT1 line. This field is writable in LIN mode only." range="4" rwaccess="R/W1TS"/> 
		<bitfield id="SETWAKEUPINTLVL" width="1" begin="1" end="1" resetval="0x0" description="Set Wake-up interrupt level.This bit is effective in LIN or SCI-compatible mode. Writing to this bit maps the Wake-up interrupt level to the INT1 line." range="1" rwaccess="R/W1TS"/> 
		<bitfield id="SETBRKDTINTLVL" width="1" begin="0" end="0" resetval="0x0" description="Set Break-detect interrupt level.This bit is effective in SCI-compatible mode only. Writing to this bit maps the Break-detect interrupt level to the INT1 line. This field is writable in SCI mode only." range="0" rwaccess="R/W1TS"/>
	</register>
