IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/LIN1_LIN1.xml
	<register id="LIN1_BRSR" acronym="LIN1_BRSR" offset="0x2C" width="32" description="The BRSR register is used to configure the baud rate of the LIN module.">
		<bitfield id="U" width="3" begin="30" end="28" resetval="0x0" description="Superfractional Divider Selection. [U]These bits are an additional fractional part for the baudrate specification. These bits allow a super fine tuning of the fractional baudrate with 7 more intermediate values for each of the M fractional divider values. See the Superfractional Divider section for more details." range="30 - 28" rwaccess="R/W"/> 
		<bitfield id="M" width="4" begin="27" end="24" resetval="0x0" description="SCI/LIN 4-bit Fractional Divider Selection. [M]These bits are effective in LIN or SCI asynchronous mode. These bits are used to select a baud rate for the SCI/LIN module, and they are a fractional part for the baud rate specification. The M divider allows fine-tuning of the baud rate over the P prescaler with 15 additional intermediate values for each of the P integer values." range="27 - 24" rwaccess="R/W"/> 
		<bitfield id="SCI_LIN_PSH" width="8" begin="23" end="16" resetval="0x0" description="PRESCALER P [High Bits].SCI/LIN 24-bit Integer Prescaler Selection.These bits are used to select a baudrate for the SCI/LIN module. These bits are effective in LIN mode and SCI compatible mode. The SCI/LIN has an internally generated serial clock determined by the LIN module input clock and the prescalers P and M in this register. The SCI/LIN uses the 24-bit integer prescaler P value to select 1 of over 16,700,000 available baud rates. The additional 4-bit fractional prescaler M refines the baudate selection." range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="SCI_LIN_PSL" width="16" begin="15" end="0" resetval="0x0" description="PRESCALER P [Low Bits].SCI/LIN 24-bit Integer Prescaler Selection.These bits are used to select a baudrate for the SCI/LIN module. These bits are effective in LIN mode and SCI compatible mode. The SCI/LIN has an internally generated serial clock determined by the LIN module input clock and the prescalers P and M in this register. The SCI/LIN uses the 24-bit integer prescaler P value to select 1 of over 16,700,000 available baud rates. The additional 4-bit fractional prescaler M refines the baudate selection." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="LIN1_SCIED" acronym="LIN1_SCIED" offset="0x30" width="32" description="The SCIED register is a duplicate copy of SCIRD register that has no affect on the RXRDY flag for use with an emulator.">
		<bitfield id="ED" width="8" begin="7" end="0" resetval="0x0" description="Receiver Emulation Data.This bit is effective in SCI-compatible mode only. Reading SCIED[7-0] does not clear the RXRDY flag. This register should be used only by an emulator that must continually read the data buffer without affecting the RXRDY flag." range="7 - 0" rwaccess="R"/>
	</register>
	<register id="LIN1_SCIRD" acronym="LIN1_SCIRD" offset="0x34" width="32" description="The SCIRD register is where received data is stored and can be read from.">
		<bitfield id="RD" width="8" begin="7" end="0" resetval="0x0" description="Received Data.This bit is effective in SCI-compatible mode only. When a frame has been completely received, the data in the frame is transferred from the receiver shift register SCIRXSHF to this register. As this transfer occurs, the RXRDY flag is set and a receive interrupt is generated if RX INT ENA [SCISETINT0.9] is set. When the data is read from SCIRD, the RXRDY flag is automatically cleared. When the SCI receives data that is fewer than eight bits in length, it loads the data into this register in a left justified format padded with trailing zeros. Therefore, your software should perform a logical shift on the data by the correct number of positions to make it right justified." range="7 - 0" rwaccess="R"/>
	</register>
	<register id="LIN1_SCITD" acronym="LIN1_SCITD" offset="0x38" width="32" description="The SCITD register is where data to be transmitted is written to by application software.">
		<bitfield id="TD" width="8" begin="7" end="0" resetval="0x0" description="Transmit dataThis bit is effective in SCI-compatible mode only. Data to be transmitted is written to this register. The transfer of data from this register to the transmit shift register SCITXSHF sets the TXRDY flag [SCIFLR.23], which indicates that SCITD is ready to be loaded with another byte of data. Note: If TX INT ENA [SCISETINT.8] is set, this data transfer also causes an interrupt. Note: Data written to the SCIRD register that is fewer than eight bits long must be right justified, but it does not need to be padded with leading zeros. " range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="LIN1_SCIPIO0" acronym="LIN1_SCIPIO0" offset="0x3C" width="32" description="The SCIPIO0 register is used to enable the LINTX and LINRX pins.">
		<bitfield id="TXFUNC" width="1" begin="2" end="2" resetval="0x0" description="Transmit pin function.This bit is effective in LIN or SCI mode. This bit defines the function of LINTX pin." range="2" rwaccess="R/W"/> 
		<bitfield id="RXFUNC" width="1" begin="1" end="1" resetval="0x0" description="Receive pin function.This bit is effective in LIN or SCI mode. This bit defines the function of the LINRX pin." range="1" rwaccess="R/W"/>
	</register>
	<register id="LIN1_SCIPIO1" acronym="LIN1_SCIPIO1" offset="0x40" width="32" description="Pin control Register 1">
		<bitfield id="TXDIR" width="1" begin="2" end="2" resetval="0x0" description="Transmit pin direction.This bit is effective in LIN or SCI mode. This bit determines the data direction on the LINTX pin if it is configured with general-purpose I/O functionality [TX FUNC = 0]. 0: general purpose input pin. 1: general-purpose output pin" range="2" rwaccess="R/W"/> 
		<bitfield id="RXDIR" width="1" begin="1" end="1" resetval="0x0" description="Receive pin direction.This bit is effective in LIN or SCI mode. This bit determines the data direction on the LINRX pin if it is configured with general-purpose I/O functionality [RX FUNC = 0]. 0: general purpose input pin. 1: general-purpose output pin" range="1" rwaccess="R/W"/>
	</register>
	<register id="LIN1_SCIPIO2" acronym="LIN1_SCIPIO2" offset="0x44" width="32" description="The SCIPIO2 register indicates the current status of the LINTX and LINRX pins.">
		<bitfield id="TXIN" width="1" begin="2" end="2" resetval="0x0" description="Transmit data in.This bit is effective in LIN or SCI-compatible mode. This bit contains the current value on the LINTX pin." range="2" rwaccess="R"/> 
		<bitfield id="RXIN" width="1" begin="1" end="1" resetval="0x0" description="Receive data in.This bit is effective in LIN or SCI-compatible mode. This bit contains the current value on the LINRX pin." range="1" rwaccess="R"/>
	</register>
	<register id="LIN1_SCIPIO3" acronym="LIN1_SCIPIO3" offset="0x48" width="32" description="Pin control Register 3">
		<bitfield id="TXOUT" width="1" begin="2" end="2" resetval="0x0" description="Transmit pin out.This bit is effective in LIN or SCI mode. This pin specifies the logic to be output on pin LINTX." range="2" rwaccess="R/W"/> 
		<bitfield id="RXOUT" width="1" begin="1" end="1" resetval="0x0" description="Receive pin out.This bit is effective in LIN or SCI mode. This pin specifies the logic to be output on pin LINRX." range="1" rwaccess="R/W"/>
	</register>
