IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/LIN1_LIN1.xml
	<register id="LIN1_LINTD1" acronym="LIN1_LINTD1" offset="0x78" width="32" description="The LINTD1 register contains the upper 4 bytes of the data to be transmitted.[[br]]NOTE: TD&#38;#60;x-1> is equivalent to Data byte &#38;#60;x> of the LIN frame.">
		<bitfield id="TD4" width="8" begin="31" end="24" resetval="0x0" description="8-bit Transmit Buffer 4.Byte4 to be transmitted is written into this register and then copied to SCITXSHF for transmission." range="31 - 24" rwaccess="R/W"/> 
		<bitfield id="TD5" width="8" begin="23" end="16" resetval="0x0" description="8-bit Transmit Buffer 5.Byte 5 to be transmitted is written into this register and then copied to SCITXSHF for transmission. " range="23 - 16" rwaccess="R/W"/> 
		<bitfield id="TD6" width="8" begin="15" end="8" resetval="0x0" description="8-bit Transmit Buffer 6.Byte 6 to be transmitted is written into this register and then copied to SCITXSHF for transmission." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="TD7" width="8" begin="7" end="0" resetval="0x0" description="8-bit Transmit Buffer 7.Byte 7 to be transmitted is written into this register and then copied to SCITXSHF for transmission." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="LIN1_MBRSR" acronym="LIN1_MBRSR" offset="0x7C" width="32" description="The MBRSR register is used to configure the expected maximum baud rate of the LIN network.">
		<bitfield id="MBR" width="13" begin="12" end="0" resetval="0x3500" description="Maximum Baud Rate Prescaler.This field is effective in LIN mode only. This 13-bit prescaler is used during the synchronization phase [see the Header Reception and Adaptive Baudrate section] of a slave module if the ADAPT bit is set. In this way, a SCI/LIN slave using an automatic or select bit rate modes detects any LIN bus legal rate automatically. The MBR value should be programmed to allow a maximum baud rate that is not more than 10% above the expected operating baud rate in the LIN network. Otherwise a s 0x00 data byte could mistakenly be detected as sync break.The default value is for a 70MHz LINCLK [0xDAC].This MBR prescaler is used by the wake-up and idle time counters for a constant expiration time relative to a 20kHz rate." range="12 - 0" rwaccess="R/W"/>
	</register>
	<register id="LIN1_Reserved_1" acronym="LIN1_Reserved_1" offset="0x80" width="32" description="tbd">
		
	</register>
	<register id="LIN1_IODFTCTRL" acronym="LIN1_IODFTCTRL" offset="0x90" width="32" description="The IODFTCTRL register is used to emulate various error and test conditions.">
		<bitfield id="BERRENA" width="1" begin="31" end="31" resetval="0x0" description="Bit Errror Enable bit.This bit is effective in LIN mode only. This bit is used to create a Bit error. When this bit is set, the bit received is ORed with 1 and passed to the Bit monitor circuitry." range="31" rwaccess="R/W"/> 
		<bitfield id="PBERRENA" width="1" begin="30" end="30" resetval="0x0" description="Physical Bus Error Enable bit.This bit is effective in LIN mode only. This bit is used to create a Physical Bus Error. When this bit is set, the bit received during Sync Break field transmission is ORed with 1 and passed to the Bit monitor circuitry" range="30" rwaccess="R/W"/> 
		<bitfield id="CERRENA" width="1" begin="29" end="29" resetval="0x0" description="Checksum Error Enable bit.This bit is effective in LIN mode only. This bit is used to create a checksum error. When this bit is set, the polarity of the CTYPE [checksum type] in the receive checksum calculator is changed so that a checksum error is generated." range="29" rwaccess="R/W"/> 
		<bitfield id="ISFERRENA" width="1" begin="28" end="28" resetval="0x0" description="Inconsistent Sync Field Error Enable bit.This bit is effective in LIN mode only. This bit is used to create an ISF error. When this bit is set, the bit widths in the sync field are varied so that the ISF check fails and the error flag is set." range="28" rwaccess="R/W"/> 
		<bitfield id="FERRENA" width="1" begin="26" end="26" resetval="0x0" description="This bit is used to create a Frame Error.This bit is effective in SCI-compatible mode only. When this bit is set, the stop bit received is ANDed with '0' and passed to the stop bit check circuitry." range="26" rwaccess="R/W"/> 
		<bitfield id="PERRENA" width="1" begin="25" end="25" resetval="0x0" description="Compatible Mode onlyThis bit is effective in SCI-compatible mode only. This bit is used to create a Parity Error. When this bit is set, in compatible mode, the parity bit received is toggled so that a parity error occurs." range="25" rwaccess="R/W"/> 
		<bitfield id="BRKDTERRENA" width="1" begin="24" end="24" resetval="0x0" description="Compatible Mode onlyThis bit is effective in SCI-compatible mode only. This bit is used to create BRKDT error [SCI mode only]. When this bit is set, the stop bit of the frame is ANDed with '0' and passed to the RSM so that a frame error occurs. Then the RX Pin is forced to continuous low for 10 Tbits so that a BRKDT error occurs." range="24" rwaccess="R/W"/> 
		<bitfield id="PINSAMPLEMASK" width="2" begin="20" end="19" resetval="0x0" description="Pin sample mask.These bits define the sample number at which the TX Pin value that is being transmitted will be inverted to verify the receive pin samples correctly with the majority detection circuitry.Note: During IODFT mode testing for the pin sample mask, the prescalar P must be programmed to be greater than 2." range="20 - 19" rwaccess="R/W"/> 
		<bitfield id="TXSHIFT" width="3" begin="18" end="16" resetval="0x0" description="Transmit shift.These bits define the delay by which the value on LINTX is delayed so that the value on LINRX is asynchronous. [Not applicable to Start Bit]" range="18 - 16" rwaccess="R/W"/> 
		<bitfield id="IODFTENA" width="4" begin="11" end="8" resetval="0x5" description="IO DFT Enable KeyThis field is used to enable the IODFT mode of the SCI/LIN module for testing. " range="11 - 8" rwaccess="R/W"/> 
		<bitfield id="LPBENA" width="1" begin="1" end="1" resetval="0x0" description="Module loopback enable.In analog loopback mode the complete communication path through the I/Os can be tested, whereas in digital loopback mode the I/O buffers are excluded from this path." range="1" rwaccess="R/W"/> 
		<bitfield id="RXPENA" width="1" begin="0" end="0" resetval="0x0" description="Module Analog loopback through receive pin enable.This bit defines whether the I/O buffers for the transmit or the receive pin are included in the communication path in analog loopback mode only." range="0" rwaccess="R/W"/>
	</register>
